---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampDoesntReach
source: html/df39109b-2179-1095-5704-0b98348c04df.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampDoesntReach Property

The ramp is not long enough to reach the top constraint. Change the slope or increase the length of the ramp.

## Syntax (C#)
```csharp
public static FailureDefinitionId RampDoesntReach { get; }
```